logs/20240610-004625_00003234/iodepth=1/rw=read/fio.log
job: (g=0): rw=read, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1
fio-3.35
Starting 1 process

job: (groupid=0, jobs=1): err= 0: pid=37543: Mon Jun 10 00:50:46 2024
  read: IOPS=321, BW=161MiB/s (169MB/s)(10.0GiB/63642msec)
    slat (usec): min=18, max=298, avg=26.51, stdev= 2.55
    clat (usec): min=934, max=101686, avg=3080.51, stdev=5968.19
     lat (usec): min=967, max=101713, avg=3107.01, stdev=5968.27
    clat percentiles (usec):
     |  1.00th=[  947],  5.00th=[  947], 10.00th=[  947], 20.00th=[  955],
     | 30.00th=[  955], 40.00th=[  971], 50.00th=[  979], 60.00th=[  979],
     | 70.00th=[  979], 80.00th=[ 1020], 90.00th=[10814], 95.00th=[15139],
     | 99.00th=[31589], 99.50th=[35914], 99.90th=[53216], 99.95th=[61604],
     | 99.99th=[72877]
   bw (  KiB/s): min=46080, max=275456, per=100.00%, avg=164968.82, stdev=50655.17, samples=127
   iops        : min=   90, max=  538, avg=322.20, stdev=98.94, samples=127
  lat (usec)   : 1000=75.56%
  lat (msec)   : 2=8.86%, 4=0.28%, 10=4.23%, 20=9.27%, 50=1.66%
  lat (msec)   : 100=0.13%, 250=0.01%
  cpu          : usr=0.04%, sys=0.91%, ctx=20486, majf=0, minf=134
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20480,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=161MiB/s (169MB/s), 161MiB/s-161MiB/s (169MB/s-169MB/s), io=10.0GiB (10.7GB), run=63642-63642msec

Disk stats (read/write):
    md127: ios=20387/37, merge=0/0, ticks=62752/1336, in_queue=64088, util=99.47%, aggrios=2569/91, aggrmerge=188/523, aggrticks=7968/2351, aggrin_queue=12104, aggrutil=19.02%
  sdf: ios=2565/90, merge=126/725, ticks=8214/2267, in_queue=12154, util=18.98%
  sdd: ios=2563/80, merge=221/221, ticks=7788/2133, in_queue=11554, util=17.87%
  sdb: ios=2564/81, merge=252/252, ticks=7995/2247, in_queue=11932, util=18.43%
  sdi: ios=2564/80, merge=157/126, ticks=7886/2015, in_queue=11425, util=18.26%
  sdg: ios=2567/95, merge=252/913, ticks=7826/2336, in_queue=11901, util=18.46%
  sde: ios=2578/97, merge=197/292, ticks=7913/2556, in_queue=12446, util=18.83%
  sdc: ios=2575/95, merge=135/261, ticks=8141/2554, in_queue=12689, util=18.80%
  sdh: ios=2580/115, merge=166/1395, ticks=7986/2704, in_queue=12733, util=19.02%